#### BuiltInFailures.SystemNavigatorFailures Members

---

|  |
| --- |
| BuiltInFailures SystemNavigatorFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SystemNavigatorFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannottFindCorrectTreeNode | Can't find the correct tree node in system browser according to the node index. |
| Public property Static member | MultipleSelectNumberIsWrong | The selected tree nodes number of system browser is wrong. |

# See Also

BuiltInFailures SystemNavigatorFailures Class

Autodesk.Revit.DB Namespace